ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиУведомленийUnbilled</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура SourceПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	Если Форма.Запись.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.Lawson") Тогда
		
		ЭлементыФормы.Идентификатор1.Видимость = Истина;
		ЭлементыФормы.Идентификатор1.Заголовок = "AU";
		ЭлементыФормы.Идентификатор1.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КостЦентры");
		
		ЭлементыФормы.Идентификатор2.Видимость = Ложь;
		
	ИначеЕсли Форма.Запись.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.OracleMI") Тогда
		
		ЭлементыФормы.Идентификатор1.Видимость = Истина;
		ЭлементыФормы.Идентификатор1.Заголовок = "Location";
		ЭлементыФормы.Идентификатор1.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
		
		ЭлементыФормы.Идентификатор2.Видимость = Истина;
		ЭлементыФормы.Идентификатор2.Заголовок = "Client";
		ЭлементыФормы.Идентификатор2.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
	ИначеЕсли Форма.Запись.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.OracleSmith") Тогда
		
		ЭлементыФормы.Идентификатор1.Видимость = Истина;
		ЭлементыФормы.Идентификатор1.Заголовок = "Location";
		ЭлементыФормы.Идентификатор1.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
		
		ЭлементыФормы.Идентификатор2.Видимость = Ложь;
		
	ИначеЕсли Форма.Запись.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.HOBs") Тогда
		
		ЭлементыФормы.Идентификатор1.Видимость = Истина;
		ЭлементыФормы.Идентификатор1.Заголовок = "Company";
		ЭлементыФормы.Идентификатор1.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
		
		ЭлементыФормы.Идентификатор2.Видимость = Истина;
		ЭлементыФормы.Идентификатор2.Заголовок = "CREW";
		ЭлементыФормы.Идентификатор2.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		
	ИначеЕсли Форма.Запись.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.Radius") Тогда
		
		ЭлементыФормы.Идентификатор1.Видимость = Истина;
		ЭлементыФормы.Идентификатор1.Заголовок = "Company";
		ЭлементыФормы.Идентификатор1.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
		
		ЭлементыФормы.Идентификатор2.Видимость = Ложь;
		
	КонецЕсли;
	
	ЭлементыФормы.ResponsibleAR.Видимость = (Форма.Запись.Уровень = ПредопределенноеЗначение("Справочник.EscalationLevels.Level1"));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры
